Revit 2024 API
IFCHybridImport Class
 Driver for Performing Hybrid Imports.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public class IFCHybridImport : IDisposable
Visual Basic
Public Class IFCHybridImport _
	Implements IDisposable
Visual C++
public ref class IFCHybridImport : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.IFCHybridImport
See Also
IFCHybridImport Members
Autodesk.Revit.DB.IFC Namespace